# Data Manipulation with Pandas

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.0.0)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

WARNING: Ignoring invalid distribution -umpy (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ffi (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ffi (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ffi (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ffi (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ffi (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -ffi (c:\users\user\anaconda3\lib\site-packages)

In [1]:
import pandas as pd

## **Creating Pandas Data Structures**

### Creating a Pandas Series

A Series, by contrast, is a sequence of data values. If a DataFrame is a table, a Series is a list. And in fact you can create one with nothing more than a list:

In [2]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

A Series is, in essence, a single column of a DataFrame. So you can assign row labels to the Series the same way as before, using an `index` parameter. However, a Series does not have a column name, it only has one overall `name`:

In [3]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

Diff between Series and Dataframe

Series --> 1D ,as array , 1 coloum \\\\\\
dataframe --> 2D(rows and coloums),full table,contains many Series in it,many coloumns

The Series and the DataFrame are intimately related. It's helpful to think of a DataFrame as actually being just a bunch of Series "glued together".

Creating a DataFrame from a Dictionary

In [ ]:
dic={'name':'hamed','age':10,'address':'cairo'}
dic

{'name': 'hamed', 'age': 10, 'address': 'cairo'}

In [4]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30,35],
        'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

**Viewing and Inspecting Data**

Viewing the First Few Rows

In [ ]:
df.head() #display first 5 rows -- tail
#df.tail(2)
#df.sample()  #random row each time

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

Getting DataFrame Information

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

Describing Statistical Information

In [ ]:
df.describe() # detect numerical column
#df.describe(include='object')

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [ ]:
#df.describe(include='object')## string --- all
df.describe(include='all')

         Name   Age      City
count       3   3.0         3
unique      3   NaN         3
top     Alice   NaN  New York
freq        1   NaN         1
mean      NaN  30.0       NaN
std       NaN   5.0       NaN
min       NaN  25.0       NaN
25%       NaN  27.5       NaN
50%       NaN  30.0       NaN
75%       NaN  32.5       NaN
max       NaN  35.0       NaN

**Selecting and Filtering Data**

Selecting Columns

In [ ]:
df['Name'] #=
df.Name

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [ ]:
df.Age

0    25
1    30
2    35
Name: Age, dtype: int64

Filtering Rows Based on Condition

In [5]:
filtered_df =  df[ df['Age'] > 30]
print(filtered_df)

      Name  Age     City
2  Charlie   35  Chicago

**Modifying Data**

Adding a New Column

In [6]:
df['Salary'] = [70000, 80000, 90000]
df

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
 3   Salary  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

Updating Column Values

In [ ]:
df['Age'] = df['Age'] + 1
#df['Salary']=df['Salary']+500
df

      Name  Age         City  Salary
0    Alice   26     New York   70000
1      Bob   31  Los Angeles   80000
2  Charlie   36      Chicago   90000

Dropping Columns

In [ ]:
df = df.drop('City', axis=1)
df.dropna() # drop rows with missing values
df

      Name  Age  Salary
0    Alice   26   70000
1      Bob   31   80000
2  Charlie   36   90000

In [2]:
import pandas as pd

 ## Employees Example

In [3]:
# Load the CSV file into a Pandas DataFrame
df = pd.read_csv('employees.csv')
#df = pd.read_csv(r'C:\Users\USER\Documents\R3\python\Session 6_ Pandas for Data Manipulation\Session Lab\employees.csv')

Viewing the First Few Rows of the DataFrame

In [12]:
print("First 5 Rows:\n")
df.head()
#df.sample()

First 5 Rows:

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30

Displaying Basic Information About the DataFrame

In [6]:
print("DataFrame Information:\n")
df.info()

DataFrame Information:

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     str
 2   Department    10 non-null     str
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     str
dtypes: int64(3), str(3)
memory usage: 612.0 bytes

In [7]:
df

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

Calculating Basic Statistics for Numerical Columns

In [8]:
print("Statistical Summary:\n")#
df.describe(include="all")#df.describe(include='object')
#df.describe()

Statistical Summary:

              ID      Name Department        Age        Salary Joining_Date
count   10.00000        10         10  10.000000     10.000000           10
unique       NaN        10          4        NaN           NaN           10
top          NaN  John Doe         HR        NaN           NaN   2020-05-21
freq         NaN         1          3        NaN           NaN            1
mean     5.50000       NaN        NaN  35.300000  68300.000000          NaN
std      3.02765       NaN        NaN   7.958922  13106.826042          NaN
min      1.00000       NaN        NaN  26.000000  50000.000000          NaN
25%      3.25000       NaN        NaN  29.250000  57250.000000          NaN
50%      5.50000       NaN        NaN  33.000000  69000.000000          NaN
75%      7.75000       NaN        NaN  40.250000  74250.000000          NaN
max     10.00000       NaN        NaN  50.000000  90000.000000          NaN

Filtering Employees by Department

In [9]:
it_employees = df[df['Department'] == 'IT']
print("IT Department Employees:\n")
it_employees.head()

IT Department Employees:

   ID          Name Department  Age  Salary Joining_Date
1   2    Jane Smith         IT   34   75000   2019-06-12
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10

In [10]:
df.describe(include='object')

C:\Users\Farouk sameh\AppData\Local\Temp\ipykernel_6424\87514550.py:1: Pandas4Warning: For backward compatibility, 'str' dtypes are included by select_dtypes when 'object' dtype is specified. This behavior is deprecated and will be removed in a future version. Explicitly pass 'str' to `include` to select them, or to `exclude` to remove them and silence this warning.
See https://pandas.pydata.org/docs/user_guide/migration-3-strings.html#string-migration-select-dtypes for details on how to write code that works with pandas 2 and 3.
  df.describe(include='object')

            Name Department Joining_Date
count         10         10           10
unique        10          4           10
top     John Doe         HR   2020-05-21
freq           1          3            1

Calculating the Average Salary for each Department

In [4]:
df['Salary'] *0.05 + df['Salary']
df['Salary']*1.05

0    52500.0
1    78750.0
2    89250.0
3    75600.0
4    71400.0
5    56700.0
6    94500.0
7    67200.0
8    73500.0
9    57750.0
Name: Salary, dtype: float64

In [5]:
average_salary_by_dept = df.groupby('Department')['Salary'].mean()  # Avg(), sum(), Min(), Max(), Count() --> scalar value
print("Average Salary by Department:\n")
average_salary_by_dept

Average Salary by Department:

Department
Finance      87500.000000
HR           53000.000000
IT           70333.333333
Marketing    69000.000000
Name: Salary, dtype: float64

 Adding a New Column for Salary After a 5% Raise

In [ ]:
df['Salary_After_Raise']=df['salary']*0.05 + df['salary']

In [6]:
df['Salary_After_Raise'] = df['Salary'] * 1.05
print("DataFrame with Salary After Raise:\n" )
df

DataFrame with Salary After Raise:

   ID           Name Department  Age  Salary Joining_Date  Salary_After_Raise
0   1       John Doe         HR   28   50000   2020-05-21             52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12             78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15             89250.0
3   4    Alice White         IT   29   72000   2021-01-04             75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30             71400.0
5   6      Eva Green         HR   41   54000   2017-04-22             56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19             94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10             67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08             73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18             57750.0

Sorting Employees by Age in Descending Order

In [7]:
sorted_by_age = df.sort_values(by='Age',ascending=False)

print("Employees Sorted by Age (Descending):\n")
sorted_by_age.head()

Employees Sorted by Age (Descending):

   ID          Name Department  Age  Salary Joining_Date  Salary_After_Raise
6   7    Mike Davis    Finance   50   90000   2016-08-19             94500.0
2   3   Bob Johnson    Finance   45   85000   2018-07-15             89250.0
5   6     Eva Green         HR   41   54000   2017-04-22             56700.0
8   9  James Wilson  Marketing   38   70000   2020-09-08             73500.0
1   2    Jane Smith         IT   34   75000   2019-06-12             78750.0

Calculating the Number of Employees in Each Department

In [8]:
x=df.groupby('Department')['Age'].count()
x

Department
Finance      2
HR           3
IT           3
Marketing    2
Name: Age, dtype: int64

In [ ]:
employee_count_by_dept = df['Department'].value_counts()


print("Number of Employees by Department:\n")


employee_count_by_dept

Number of Employees by Department:

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

Finding Employees Who Joined After 2020

In [10]:
ee=df.groupby('Department')['ID'].count()
ee

Department
Finance      2
HR           3
IT           3
Marketing    2
Name: ID, dtype: int64

In [52]:
df.info()   #x=55   str(x)
            #y='20'  int(y)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes

In [11]:
df['Joining_Date'] = pd.to_datetime(df['Joining_Date'])
recent_joins = df[df['Joining_Date'] > '2020-01-01']
print("Employees Joined After 2020:\n")
recent_joins.head()

Employees Joined After 2020:

   ID          Name Department  Age  Salary Joining_Date  Salary_After_Raise
0   1      John Doe         HR   28   50000   2020-05-21             52500.0
3   4   Alice White         IT   29   72000   2021-01-04             75600.0
7   8  Linda Taylor         IT   26   64000   2022-02-10             67200.0
8   9  James Wilson  Marketing   38   70000   2020-09-08             73500.0
9  10   Sarah Adams         HR   30   55000   2021-03-18             57750.0

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 612.0+ bytes

Saving the Filtered DataFrame to a New CSV File

In [14]:
recent_joins.to_csv('recent_joins.csv', index=False)
print("Filtered data saved to recent_joins.csv.")

Filtered data saved to recent_joins.csv.

## Wine Review Example

In [12]:
reviews = pd.read_csv(r"winemag-data-130k-v2.csv")

In [50]:
reviews.head()

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulk Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin OKeefe,@kerinokeefe,Nicosia 2013 Vulk Bianco (Etna),White Blend,Nicosia
1,1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks

In [22]:
reviews.price.dtype
#reviews['price'].dtype

dtype('float64')

In [56]:
reviews.sample()

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
27616,27616,South Africa,"The earth, smoke, saddle-leather aromas and fl...",Kevin Arnold,88,30.0,Stellenbosch,NaN,NaN,NaN,NaN,Waterford 1999 Kevin Arnold Shiraz (Stellenbosch),Shiraz,Waterford

In [23]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129971 entries, 0 to 129970
Data columns (total 14 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   Unnamed: 0             129971 non-null  int64
 1   country                129908 non-null  object
 2   description            129971 non-null  object
 3   designation            92506 non-null   object
 4   points                 129971 non-null  int64
 5   price                  120975 non-null  float64
 6   province               129908 non-null  object
 7   region_1               108724 non-null  object
 8   region_2               50511 non-null   object
 9   taster_name            103727 non-null  object
 10  taster_twitter_handle  98758 non-null   object
 11  title                  129971 non-null  object
 12  variety                129970 non-null  object
 13  winery                 129971 non-null  object
dtypes: float64(1), int64(2), object(11)
memory usage: 13.9+ MB

Alternatively, the `dtypes` property returns the `dtype` of _every_ column in the DataFrame:

In [13]:
reviews.dtypes

Unnamed: 0                 int64
country                      str
description                  str
designation                  str
points                     int64
price                    float64
province                     str
region_1                     str
region_2                     str
taster_name                  str
taster_twitter_handle        str
title                        str
variety                      str
winery                       str
dtype: object

Data types tell us something about how pandas is storing the data internally. `float64` means that it's using a 64-bit floating point number; `int64` means a similarly sized integer instead, and so on.

One peculiarity to keep in mind (and on display very clearly here) is that columns consisting entirely of strings do not get their own type; they are instead given the `object` type.

It's possible to convert a column of one type into another wherever such a conversion makes sense by using the `astype()` function. For example, we may transform the `points` column from its existing `int64` data type into a `float64` data type:

In [14]:
reviews.points=reviews.points.astype('float64') # "87" > 87.0

In [15]:
reviews.info()

<class 'pandas.DataFrame'>
RangeIndex: 129971 entries, 0 to 129970
Data columns (total 14 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   Unnamed: 0             129971 non-null  int64
 1   country                129908 non-null  str
 2   description            129971 non-null  str
 3   designation            92506 non-null   str
 4   points                 129971 non-null  float64
 5   price                  120975 non-null  float64
 6   province               129908 non-null  str
 7   region_1               108724 non-null  str
 8   region_2               50511 non-null   str
 9   taster_name            103727 non-null  str
 10  taster_twitter_handle  98758 non-null   str
 11  title                  129971 non-null  str
 12  variety                129970 non-null  str
 13  winery                 129971 non-null  str
dtypes: float64(2), int64(1), str(11)
memory usage: 13.9 MB

A DataFrame or Series index has its own `dtype`, too:

In [16]:
reviews.index.dtype

dtype('int64')

In [ ]:
price = "100$"
price = price.replace("$","") # price = price.replace("$","")  # remove the dollar sign from the string to can convert it to a numeric type (integer or float) for further calculations or analysis.
price = int(price)
print(price)

100

**Indexing in pandas:**

The indexing operator and attribute selection are nice because they work just like they do in the rest of the Python ecosystem. As a novice, this makes them easy to pick up and use. However, pandas has its own accessor operators, `loc` and `iloc`. For more advanced operations, these are the ones you're supposed to be using.

**Index-based selection:**

Pandas indexing works in one of two paradigms. The first is **index-based selection**: selecting data based on its numerical position in the data. `iloc` follows this paradigm.

To select the first row of data in a DataFrame, we may use the following:

In [18]:
reviews.head(10)

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulk Bianco,87.0,NaN,Sicily & Sardinia,Etna,NaN,Kerin OKeefe,@kerinokeefe,Nicosia 2013 Vulk Bianco (Etna),White Blend,Nicosia
1,1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87.0,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87.0,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87.0,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87.0,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks
5,5,Spain,Blackberry and raspberry aromas show a typical...,Ars In Vitro,87.0,15.0,Northern Spain,Navarra,NaN,Michael Schachner,@wineschach,Tandem 2011 Ars In Vitro Tempranillo-Merlot (N...,Tempranillo-Merlot,Tandem
6,6,Italy,"Here's a bright, informal red that opens with ...",Belsito,87.0,16.0,Sicily & Sardinia,Vittoria,NaN,Kerin OKeefe,@kerinokeefe,Terre di Giurfo 2013 Belsito Frappato (Vittoria),Frappato,Terre di Giurfo
7,7,France,This dry and restrained wine offers spice in p...,NaN,87.0,24.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Trimbach 2012 Gewurztraminer (Alsace),Gewrztraminer,Trimbach
8,8,Germany,Savory dried thyme notes accent sunnier flavor...,Shine,87.0,12.0,Rheinhessen,NaN,NaN,Anna Lee C. Iijima,NaN,Heinz Eifel 2013 Shine Gewrztraminer (Rheinhe...,Gewrztraminer,Heinz Eifel
9,9,France,This has great depth of flavor with its fresh ...,Les Natures,87.0,27.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Jean-Baptiste Adam 2012 Les Natures Pinot Gris...,Pinot Gris,Jean-Baptiste Adam

In [17]:
reviews.iloc[0,1]

'Italy'

In [30]:
reviews.iloc[:,0]

0              0
1              1
2              2
3              3
4              4
           ...
129966    129966
129967    129967
129968    129968
129969    129969
129970    129970
Name: Unnamed: 0, Length: 129971, dtype: int64

In [15]:
reviews.iloc[3:5,3:6]

                          designation  points  price
3                Reserve Late Harvest      87   13.0
4  Vintner's Reserve Wild Child Block      87   65.0

Both `loc` and `iloc` are row-first, column-second. This is the opposite of what we do in native Python, which is column-first, row-second.

This means that it's marginally easier to retrieve rows, and marginally harder to get retrieve columns. To get a column with `iloc`, we can do the following:

In [31]:
reviews.iloc[:, 0]

0              0
1              1
2              2
3              3
4              4
           ...
129966    129966
129967    129967
129968    129968
129969    129969
129970    129970
Name: Unnamed: 0, Length: 129971, dtype: int64

On its own, the `:` operator, which also comes from native Python, means "everything". When combined with other selectors, however, it can be used to indicate a range of values. For example, to select the `country` column from just the first, second, and third row, we would do:

In [32]:
reviews.iloc[8:10,2:5]

                                         description  designation  points
8  Savory dried thyme notes accent sunnier flavor...        Shine    87.0
9  This has great depth of flavor with its fresh ...  Les Natures    87.0

In [33]:
reviews.iloc[13,12]

'Nerello Mascalese'

In [16]:
reviews.iloc[:3, 0]

0    0
1    1
2    2
Name: Unnamed: 0, dtype: int64

In [17]:
reviews.iloc[6]

Unnamed: 0                                                               6
country                                                              Italy
description              Here's a bright, informal red that opens with ...
designation                                                        Belsito
points                                                                  87
price                                                                 16.0
province                                                 Sicily & Sardinia
region_1                                                          Vittoria
region_2                                                               NaN
taster_name                                                  Kerin OKeefe
taster_twitter_handle                                         @kerinokeefe
title                     Terre di Giurfo 2013 Belsito Frappato (Vittoria)
variety                                                           Frappato
winery                                                     Terre di Giurfo
Name: 6, dtype: object

Or, to select just the second and third entries, we would do:

In [63]:
reviews.iloc[1:3, 1]

1    Portugal
2          US
Name: country, dtype: object

It's also possible to pass a list:

In [64]:
reviews.iloc[[0, 1, 2], 1]

0       Italy
1    Portugal
2          US
Name: country, dtype: object

Finally, it's worth knowing that negative numbers can be used in selection. This will start counting forwards from the _end_ of the values. So for example here are the last five elements of the dataset.

In [36]:
reviews.iloc[-5:]
#reviews.tail()

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
129966,129966,Germany,Notes of honeysuckle and cantaloupe sweeten th...,Brauneberger Juffer-Sonnenuhr Sptlese,90.0,28.0,Mosel,NaN,NaN,Anna Lee C. Iijima,NaN,Dr. H. Thanisch (Erben Mller-Burggraef) 2013 ...,Riesling,Dr. H. Thanisch (Erben Mller-Burggraef)
129967,129967,US,Citation is given as much as a decade of bottl...,NaN,90.0,75.0,Oregon,Oregon,Oregon Other,Paul Gregutt,@paulgwine,Citation 2004 Pinot Noir (Oregon),Pinot Noir,Citation
129968,129968,France,Well-drained gravel soil gives this wine its c...,Kritt,90.0,30.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Gresser 2013 Kritt Gewurztraminer (Als...,Gewrztraminer,Domaine Gresser
129969,129969,France,"A dry style of Pinot Gris, this is crisp with ...",NaN,90.0,32.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Marcel Deiss 2012 Pinot Gris (Alsace),Pinot Gris,Domaine Marcel Deiss
129970,129970,France,"Big, rich and off-dry, this is powered by inte...",Lieu-dit Harth Cuve Caroline,90.0,21.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Domaine Schoffit 2012 Lieu-dit Harth Cuve Car...,Gewrztraminer,Domaine Schoffit

### Label-based selection

The second paradigm for attribute selection is the one followed by the `loc` operator: **label-based selection**. In this paradigm, it's the data index value, not its position, which matters.

For example, to get the first entry in `reviews`, we would now do the following:

In [12]:
reviews.loc[0, 'country']

'Italy'

`iloc` is conceptually simpler than `loc` because it ignores the dataset's indices. When we use `iloc` we treat the dataset like a big matrix (a list of lists), one that we have to index into by position. `loc`, by contrast, uses the information in the indices to do its work. Since your dataset usually has meaningful indices, it's usually easier to do things using `loc` instead. For example, here's one operation that's much easier using `loc`:

In [13]:
reviews.loc[:, ['taster_name', 'taster_twitter_handle', 'points']]

          taster_name taster_twitter_handle  points
0       Kerin OKeefe          @kerinokeefe      87
1          Roger Voss            @vossroger      87
...               ...                   ...     ...
129969     Roger Voss            @vossroger      90
129970     Roger Voss            @vossroger      90

[129971 rows x 3 columns]

In [37]:
reviews.iloc[15,1:6]

country                                                  Germany
description    Zesty orange peels and apple notes abound in t...
designation                                                Devon
points                                                      87.0
price                                                       24.0
Name: 15, dtype: object

### Choosing between `loc` and `iloc`

When choosing or transitioning between `loc` and `iloc`, there is one "gotcha" worth keeping in mind, which is that the two methods use slightly different indexing schemes.

`iloc` uses the Python stdlib indexing scheme, where the first element of the range is included and the last one excluded. So `0:10` will select entries `0,...,9`. `loc`, meanwhile, indexes inclusively. So `0:10` will select entries `0,...,10`.

Why the change? Remember that loc can index any stdlib type: strings, for example. If we have a DataFrame with index values `Apples, ..., Potatoes, ...`, and we want to select "all the alphabetical fruit choices between Apples and Potatoes", then it's a lot more convenient to index `df.loc['Apples':'Potatoes']` than it is to index something like `df.loc['Apples', 'Potatoet']` (`t` coming after `s` in the alphabet).

This is particularly confusing when the DataFrame index is a simple numerical list, e.g. `0,...,1000`. In this case `df.iloc[0:1000]` will return 1000 entries, while `df.loc[0:1000]` return 1001 of them! To get 1000 elements using `loc`, you will need to go one lower and ask for `df.loc[0:999]`.

Otherwise, the semantics of using `loc` are the same as those for `iloc`.

# Missing data

Entries missing values are given the value `NaN`, short for "Not a Number". For technical reasons these `NaN` values are always of the `float64` dtype.

Pandas provides some methods specific to missing data. To select `NaN` entries you can use `pd.isnull()` (or its companion `pd.notnull()`). This is meant to be used thusly:

In [16]:
reviews[pd.isnull(reviews.country)]
reviews[reviews.country.isnull()]# isna()  #fillnull('Egypt') fillna

,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
913,NaN,"Amber in color, this wine has aromas of peach ...",Asureti Valley,87,30.0,NaN,NaN,NaN,Mike DeSimone,@worldwineguys,Gotsa Family Wines 2014 Asureti Valley Chinuri,Chinuri,Gotsa Family Wines
3131,NaN,"Soft, fruity and juicy, this is a pleasant, si...",Partager,83,NaN,NaN,NaN,NaN,Roger Voss,@vossroger,Barton & Guestier NV Partager Red,Red Blend,Barton & Guestier
4243,NaN,"Violet-red in color, this semisweet wine has a...",Red Naturally Semi-Sweet,88,18.0,NaN,NaN,NaN,Mike DeSimone,@worldwineguys,Kakhetia Traditional Winemaking 2012 Red Natur...,Ojaleshi,Kakhetia Traditional Winemaking
9509,NaN,This mouthwatering blend starts with a nose of...,Theopetra Malagouzia-Assyrtiko,92,28.0,NaN,NaN,NaN,Susan Kostrzewa,@suskostrzewa,Tsililis 2015 Theopetra Malagouzia-Assyrtiko W...,White Blend,Tsililis
9750,NaN,This orange-style wine has a cloudy yellow-gol...,Orange Nikolaevo Vineyard,89,28.0,NaN,NaN,NaN,Jeff Jenssen,@worldwineguys,Ross-idi 2015 Orange Nikolaevo Vineyard Chardo...,Chardonnay,Ross-idi
...,...,...,...,...,...,...,...,...,...,...,...,...,...
124176,NaN,This Swiss red blend is composed of four varie...,Les Romaines,90,30.0,NaN,NaN,NaN,Jeff Jenssen,@worldwineguys,Les Frres Dutruy 2014 Les Romaines Red,Red Blend,Les Frres Dutruy
129407,NaN,Dry spicy aromas of dusty plum and tomato add ...,Reserve,89,22.0,NaN,NaN,NaN,Michael Schachner,@wineschach,El Capricho 2015 Reserve Cabernet Sauvignon,Cabernet Sauvignon,El Capricho
129408,NaN,El Capricho is one of Uruguay's more consisten...,Reserve,89,22.0,NaN,NaN,NaN,Michael Schachner,@wineschach,El Capricho 2015 Reserve Tempranillo,Tempranillo,El Capricho
129590,NaN,"A blend of 60% Syrah, 30% Cabernet Sauvignon a...",Shah,90,30.0,NaN,NaN,NaN,Mike DeSimone,@worldwineguys,Bylba 2012 Shah Red,Red Blend,Bylba
129900,NaN,This wine offers a delightful bouquet of black...,NaN,91,32.0,NaN,NaN,NaN,Mike DeSimone,@worldwineguys,Psagot 2014 Merlot,Merlot,Psagot

Replacing missing values is a common operation.  Pandas provides a really handy method for this problem: `fillna()`. `fillna()` provides a few different strategies for mitigating such data. For example, we can simply replace each `NaN` with an `"Unknown"`:

In [47]:
reviews.region_2.fillna("Unknown")

0                   Unknown
1                   Unknown
2         Willamette Valley
3                   Unknown
4         Willamette Valley
                ...
129966              Unknown
129967         Oregon Other
129968              Unknown
129969              Unknown
129970              Unknown
Name: region_2, Length: 129971, dtype: object

In [46]:
import numpy as np
reviews.region_2=reviews.region_2.replace(np.nan,"Unknown")

In [ ]:
# reviews.region_2=reviews.region_2.replace(np.nan,"Unknown") == reviews.region_2.fillna("Unknown") 
#can make reviews.region_2=reviews.region_2.replace(np.nan,reviews.iloc[0,5]) # replace nan with the value of the first row and 5th column (region_2) in the DataFrame

In [48]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129971 entries, 0 to 129970
Data columns (total 14 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   Unnamed: 0             129971 non-null  int64
 1   country                129908 non-null  object
 2   description            129971 non-null  object
 3   designation            92506 non-null   object
 4   points                 129971 non-null  float64
 5   price                  120975 non-null  float64
 6   province               129908 non-null  object
 7   region_1               108724 non-null  object
 8   region_2               129971 non-null  object
 9   taster_name            103727 non-null  object
 10  taster_twitter_handle  98758 non-null   object
 11  title                  129971 non-null  object
 12  variety                129970 non-null  object
 13  winery                 129971 non-null  object
dtypes: float64(2), int64(1), object(11)
memory usage: 13.9+ MB

Or we could fill each missing value with the first non-null value that appears sometime after the given record in the database. This is known as the backfill strategy.

Alternatively, we may have a non-null value that we would like to replace. For example, suppose that since this dataset was published, reviewer Kerin O'Keefe has changed her Twitter handle from `@kerinokeefe` to `@kerino`. One way to reflect this in the dataset is using the `replace()` method:

In [8]:
reviews.taster_twitter_handle.replace("@kerinokeefe", "@kerino")

0            @kerino
1         @vossroger
             ...
129969    @vossroger
129970    @vossroger
Name: taster_twitter_handle, Length: 129971, dtype: object

The `replace()` method is worth mentioning here because it's handy for replacing missing data which is given some kind of sentinel value in the dataset: things like `"Unknown"`, `"Undisclosed"`, `"Invalid"`, and so on.

https://realpython.com/quizzes/python-csv/

In [3]:
from platform import python_version
print(python_version())

3.13.9